-- MySQL dump 10.13  Distrib 8.0.13, for macos10.14 (x86_64)
--
-- Host: localhost    Database: StuProgDB
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `OOP`
--

DROP TABLE IF EXISTS `OOP`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `OOP` (
  `stuName` varchar(45) NOT NULL,
  `stuID` int(11) NOT NULL,
  `stuTeam` varchar(45) NOT NULL,
  `stuUniq` varchar(45) NOT NULL,
  `mid` int(11) NOT NULL,
  `last` int(11) NOT NULL,
  `assignment` int(11) NOT NULL,
  `report` int(11) NOT NULL,
  `quiz` int(11) NOT NULL,
  `presentation` int(11) NOT NULL,
  `attend1` int(11) DEFAULT NULL,
  `attend2` int(11) DEFAULT NULL,
  `attend3` int(11) DEFAULT NULL,
  `attend4` int(11) DEFAULT NULL,
  `attend5` int(11) DEFAULT NULL,
  `attend6` int(11) DEFAULT NULL,
  `attend7` int(11) DEFAULT NULL,
  `attend8` int(11) DEFAULT NULL,
  `attend9` int(11) DEFAULT NULL,
  `attend10` int(11) DEFAULT NULL,
  `attend11` int(11) DEFAULT NULL,
  `attend12` int(11) DEFAULT NULL,
  `attend13` int(11) DEFAULT NULL,
  `attend14` int(11) DEFAULT NULL,
  `attend15` int(11) DEFAULT NULL,
  `attend16` int(11) DEFAULT NULL,
  PRIMARY KEY (`stuID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `OOP`
--

LOCK TABLES `OOP` WRITE;
/*!40000 ALTER TABLE `OOP` DISABLE KEYS */;
INSERT INTO `OOP` VALUES ('디보',60130002,'레전드','재수강',90,80,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김태연',60140001,'워너원','없음',100,100,10,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김가은',60140002,'워너원','재수강',60,64,10,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김지은',60140003,'워너원','없음',50,100,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('조강직',60140006,'밥머거','없음',100,40,9,3,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄하마',60140007,'밥머거','없음',60,10,10,2,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄지인',60140008,'밥머거','없음',50,100,8,1,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김지인',60140009,'밥버거','없음',40,60,10,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박지인',60140010,'밥버거','없음',10,50,5,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('이지인',60140011,'밥버거','재수강',100,40,4,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('모지인',60140013,'토마토','없음',50,80,2,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박수리',60140014,'토마토','없음',100,70,1,10,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김수리',60140015,'토마토','없음',60,100,10,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('장수리',60140016,'토마토','재수강',50,60,9,10,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄수리',60140017,'쥬시','없음',40,50,8,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('배주시',60140018,'쥬시','없음',10,40,4,5,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('나주시',60140019,'쥬시','없음',60,10,10,4,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김하나',60140020,'쥬시','없음',50,10,10,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('장하나',60140021,'마포갈매기','없음',100,40,10,2,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박하나',60140022,'마포갈매기','없음',60,50,9,1,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄하나',60140023,'마포갈매기','없음',50,100,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('고하나',60140024,'마포갈매기','재수강',40,60,10,9,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('고구마',60140025,'고오급','없음',10,50,5,5,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('사이다',60140026,'고오급','없음',100,40,4,4,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('콜라',60140027,'고오급','없음',60,10,3,3,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('금강현우',60140028,'고오급','없음',50,40,2,2,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('리스테린',60140029,'치카치카','없음',40,50,1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('아이폰',60140033,'모바일','재수강',50,90,10,2,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('갤럭시',60140034,'모바일','없음',40,100,8,1,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김이수',60152121,'워너원','없음',40,60,10,5,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('허아라',60152213,'밥머거','없음',10,50,10,4,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('소니',60160021,'모바일','없음',20,40,10,9,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('샤오미',60170032,'모바일','없음',10,30,10,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('페리오',60170113,'치카치카','없음',10,60,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('슈퍼비',60171111,'레전드','없음',30,50,10,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('비와이',60171123,'레전드','없음',40,60,10,10,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('노라저',60172133,'밥버거','없음',60,10,3,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('개념이',60172521,'치카치카','없음',60,80,10,3,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('빈지노',60173321,'레전드','없음',70,70,10,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('뽀로로',60181321,'치카치카','없음',100,70,9,9,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1);
/*!40000 ALTER TABLE `OOP` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-03 20:38:09
