-- MySQL dump 10.13  Distrib 8.0.13, for macos10.14 (x86_64)
--
-- Host: localhost    Database: StuProgDB
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `AOOP`
--

DROP TABLE IF EXISTS `AOOP`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `AOOP` (
  `stuName` varchar(45) NOT NULL,
  `stuID` int(11) NOT NULL,
  `stuTeam` varchar(45) NOT NULL,
  `stuUniq` varchar(45) NOT NULL,
  `mid` int(11) NOT NULL,
  `last` int(11) NOT NULL,
  `assignment` int(11) NOT NULL,
  `report` int(11) NOT NULL,
  `quiz` int(11) NOT NULL,
  `presenation` int(11) NOT NULL,
  `attend1` int(11) DEFAULT NULL,
  `attend2` int(11) DEFAULT NULL,
  `attend3` int(11) DEFAULT NULL,
  `attend4` int(11) DEFAULT NULL,
  `attend5` int(11) DEFAULT NULL,
  `attend6` int(11) DEFAULT NULL,
  `attend7` int(11) DEFAULT NULL,
  `attend8` int(11) DEFAULT NULL,
  `attend9` int(11) DEFAULT NULL,
  `attend10` int(11) DEFAULT NULL,
  `attend11` int(11) DEFAULT NULL,
  `attend12` int(11) DEFAULT NULL,
  `attend13` int(11) DEFAULT NULL,
  `attend14` int(11) DEFAULT NULL,
  `attend15` int(11) DEFAULT NULL,
  `attend16` int(11) DEFAULT NULL,
  PRIMARY KEY (`stuID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `AOOP`
--

LOCK TABLES `AOOP` WRITE;
/*!40000 ALTER TABLE `AOOP` DISABLE KEYS */;
INSERT INTO `AOOP` VALUES ('디보',60130002,'텐서','재수강',90,80,40,70,90,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('김태연',60140001,'하리보','없음',100,100,100,100,100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('김가은',60140002,'하리보','재수강',60,64,90,90,90,90,0,0,0,0,0,0,0,0,0,0,-1,0,0,0,0,0),('김지은',60140003,'하리보','없음',50,100,80,80,80,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('조강직',60140006,'배고파','재수강',100,40,50,90,50,50,-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('엄하마',60140007,'배고파','없음',60,10,40,80,40,40,0,0,0,-1,0,0,0,0,0,0,0,0,0,0,0,0),('엄지인',60140008,'배고파','없음',100,100,30,70,30,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('김지인',60140009,'종강','재수강',60,100,90,60,100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('박지인',60140010,'종강','없음',50,60,80,50,90,90,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('이지인',60140011,'종강','없음',40,50,70,100,80,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('모지인',60140013,'집가자','없음',100,10,50,80,60,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('박수리',60140014,'집가자','없음',60,100,40,70,50,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('김수리',60140015,'집가자','없음',60,60,90,60,100,90,0,0,0,0,0,0,0,-1,0,0,0,0,0,0,0,0),('장수리',60140016,'집가자','없음',50,60,80,50,90,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('엄수리',60140017,'어머나','없음',40,50,70,40,80,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('배주시',60140018,'어머나','없음',10,40,60,30,70,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('나주시',60140019,'어머나','없음',60,100,90,90,60,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('김하나',60140020,'어머나','재수강',100,60,80,70,50,90,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('장하나',60140021,'연어상회','없음',60,50,70,100,40,80,0,0,0,0,-1,0,0,0,0,0,0,0,0,0,0,0),('박하나',60140022,'연어상회','없음',50,100,60,90,50,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('엄하나',60140023,'연어상회','없음',40,60,90,80,100,60,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('고하나',60140024,'연어상회','재수강',10,50,80,70,90,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('고구마',60140025,'오버워치','없음',100,40,70,60,80,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('사이다',60140026,'오버워치','없음',60,10,60,50,70,90,0,0,0,0,0,-1,0,0,0,0,0,0,0,0,0,0),('콜라',60140027,'오버워치','없음',60,100,90,100,100,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('금강현우',60140028,'오버워치','없음',50,60,80,90,50,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('리스테린',60140029,'디비하자','없음',100,50,70,80,100,60,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('아이폰',60140033,'루트','재수강',10,50,80,80,100,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('갤럭시',60140034,'루트','없음',100,40,70,70,90,60,0,0,0,0,0,0,0,0,0,0,0,0,-1,0,0,0),('김이수',60152121,'하리보','없음',40,60,70,70,70,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('허아라',60152213,'배고파','없음',10,50,60,100,60,60,0,0,0,0,0,0,0,0,0,0,0,0,0,0,-1,0),('소니',60160021,'루트','없음',20,100,80,50,70,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('샤오미',60170032,'루트','없음',60,10,90,60,80,50,0,0,0,0,0,0,-1,0,0,0,0,0,0,0,0,0),('페리오',60170113,'디비하자','없음',60,60,60,70,90,100,0,0,0,0,0,0,0,0,0,0,-1,0,0,0,0,0),('슈퍼비',60171111,'텐서','없음',30,60,70,100,60,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('비와이',60171123,'텐서','없음',40,60,60,90,50,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,-1),('노라저',60172133,'종강','없음',10,40,60,90,70,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('개념이',60172521,'디비하자','없음',40,60,90,90,70,80,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('빈지노',60173321,'텐서','없음',70,70,50,80,100,90,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0),('뽀로로',60181321,'디비하자','없음',50,100,50,100,80,90,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
/*!40000 ALTER TABLE `AOOP` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-03 22:09:40
