-- MySQL dump 10.13  Distrib 8.0.13, for macos10.14 (x86_64)
--
-- Host: localhost    Database: StuProgDB
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `WEBPROG`
--

DROP TABLE IF EXISTS `WEBPROG`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `WEBPROG` (
  `stuName` varchar(45) NOT NULL,
  `stuID` int(11) NOT NULL,
  `stuTeam` varchar(45) NOT NULL,
  `stuUniq` varchar(45) NOT NULL,
  `mid` int(11) NOT NULL,
  `last` int(11) NOT NULL,
  `assignment` int(11) NOT NULL,
  `report` int(11) NOT NULL,
  `quiz` int(11) NOT NULL,
  `presentation` int(11) NOT NULL,
  `attend1` int(11) DEFAULT NULL,
  `attend2` int(11) DEFAULT NULL,
  `attend3` int(11) DEFAULT NULL,
  `attend4` int(11) DEFAULT NULL,
  `attend5` int(11) DEFAULT NULL,
  `attend6` int(11) DEFAULT NULL,
  `attend7` int(11) DEFAULT NULL,
  `attend8` int(11) DEFAULT NULL,
  `attend9` int(11) DEFAULT NULL,
  `attend10` int(11) DEFAULT NULL,
  `attend11` int(11) DEFAULT NULL,
  `attend12` int(11) DEFAULT NULL,
  `attend13` int(11) DEFAULT NULL,
  `attend14` int(11) DEFAULT NULL,
  `attend15` int(11) DEFAULT NULL,
  `attend16` int(11) DEFAULT NULL,
  PRIMARY KEY (`stuID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `WEBPROG`
--

LOCK TABLES `WEBPROG` WRITE;
/*!40000 ALTER TABLE `WEBPROG` DISABLE KEYS */;
INSERT INTO `WEBPROG` VALUES ('김태연',60140001,'넘버원','없음',100,100,10,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김가은',60140002,'넘버원','없음',60,64,10,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김지은',60140003,'넘버원','없음',50,20,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김이직',60140004,'넘버원','없음',40,30,10,10,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('조우직',60140005,'투스타','재수강',10,40,10,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('조강직',60140006,'투스타','없음',70,50,9,10,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄하마',60140007,'투스타','없음',40,60,10,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄지인',60140008,'투스타','없음',30,70,8,10,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김지인',60140009,'지인스','없음',10,80,10,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박지인',60140010,'지인스','없음',80,90,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('이지인',60140011,'지인스','재수강',55,100,10,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('나지인',60140012,'지인스','없음',41,90,10,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('모지인',60140013,'수리스','없음',23,80,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박수리',60140014,'수리스','없음',21,70,10,10,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김수리',60140015,'수리스','없음',60,60,10,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('장수리',60140016,'수리스','재수강',49,50,10,10,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄수리',60140017,'띵지','없음',76,40,8,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('배주시',60140018,'띵지','없음',45,30,4,10,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('나주시',60140019,'띵지','없음',53,20,10,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김하나',60140020,'띵지','없음',43,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('장하나',60140021,'하나들','없음',12,40,10,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박하나',60140022,'하나들','없음',40,50,9,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄하나',60140023,'하나들','없음',50,60,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('고하나',60140024,'하나들','재수강',60,70,10,10,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('고구마',60140025,'음식들','없음',70,80,9,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('사이다',60140026,'음식들','없음',80,90,10,10,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('콜라',60140027,'음식들','없음',90,100,10,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('금강현우',60140028,'음식들','없음',100,40,10,10,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('리스테린',60140029,'스펙들','없음',90,50,9,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('토익이',60140030,'스펙들','없음',80,60,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('토플이',60140031,'스펙들','없음',70,70,7,10,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('텝스이',60140032,'스펙들','없음',60,80,10,10,9,9,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('아이폰',60140033,'핸드폰','재수강',50,90,10,10,8,8,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('갤럭시',60140034,'핸드폰','없음',40,100,8,10,7,7,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('용인이',60140035,'핸드폰','없음',30,30,10,10,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김용인',60140036,'핸드폰','없음',20,40,10,10,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('박용지',60140037,'레전드','없음',30,50,10,10,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('엄용임',60140038,'레전드','없음',40,60,10,10,3,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('신기자',60140039,'레전드','없음',70,70,10,10,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('김기자',60150011,'레전드','없음',90,80,10,10,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1);
/*!40000 ALTER TABLE `WEBPROG` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-03 20:38:10
